# include <iostream>
# include <ctime>
# include <fstream>
# include "Drink.h"
# include "Menu.h"

using namespace std;

/*
Симулятор питної машини. Напишіть програму, що імітує автомат безалкогольних напоїв. 
Програма повинна використовувати структуру, яка зберігає такі дані: 
Назва напою, 
Вартість напою, 
Кількість напоїв у машині.

Програма повинна створити масив з п'яти структур. Елементи слід ініціалізувати такими даними:
Номер випивки
назви 
вартість машини

Кола 75 20
Прохолодний чай. 75 20
Лимон-лайм 75 20
Виноградна сода. 80 20
Крем-сода. 80 20

Кожен раз, коли програма запускається, вона повинна вводити цикл, який виконує такі кроки: 
На екрані відображається список напоїв. Користувачеві слід дозволити або вийти з програми, або випити напій. 
Якщо користувач вибере напій, він або вона введе наступну суму грошей, яку потрібно вставити в машину для напоїв. 
Програма повинна відобразити кількість змін, які будуть повернуті, і відняти одну з кількості напою, залишеного в машині. 
Якщо користувач вибирає напій, який був розпроданий, має з’явитися повідомлення. Потім петля повторюється. 
Коли користувач вирішить вийти з програми, він повинен відобразити загальну суму зароблених машин.
Перевірка введення: Коли користувач вводить суму грошей, не приймайте мінус значення або значення більше 1,00 дол.*/

int main()
{
	Drink drinks[SIZE];

	


	system("pause");
	return 0;

}